app/controllers/objets_controller.rb

  def index
    @objets = Objet.all
---
SELECT "objets".* FROM "objets"

  def create
    @objet = Objet.new(objet_params)

    respond_to do |format|
      if @objet.save
---
INSERT INTO "objets" ("titre", "description", "photo", "lieu", "date", "statut", "created_at", "updated_at") VALUES ('"DS', 'Relou pls', 'https://upload.wikimedia.org/wikipedia/commons/0/0a/Nintendo-3DS-AquaOpen.png', 'Bordeaux', '2025-01-04', 'perdu', '2025-02-20 16:14:12.455496', '2025-02-20 16:14:12.455496') RETURNING "id"

  def update
    respond_to do |format|
      if @objet.update(objet_params)
---
UPDATE "objets" SET "statut" = 'trouvé', "updated_at" = '2025-02-21 16:24:47.791880' WHERE "objets"."id" = 4

  def destroy
    @objet.destroy!
---
DELETE FROM "objets" WHERE "objets"."id" = 1

    def set_objet
      @objet = Objet.find(params.expect(:id))
---
SELECT "objets".* FROM "objets" WHERE "objets"."id" = 1 LIMIT 1